graph(%self.1 : __torch__.torchvision.models.mobilenetv3.MobileNetV3,
      %x.1 : Float(1, 3, 224, 224, strides=[150528, 50176, 224, 1], requires_grad=0, device=cpu)):
  %classifier : __torch__.torch.nn.modules.container.___torch_mangle_195.Sequential = prim::GetAttr[name="classifier"](%self.1)
  %avgpool : __torch__.torch.nn.modules.pooling.___torch_mangle_192.AdaptiveAvgPool2d = prim::GetAttr[name="avgpool"](%self.1)
  %features : __torch__.torch.nn.modules.container.___torch_mangle_191.Sequential = prim::GetAttr[name="features"](%self.1)
  %11 : int = prim::Constant[value=576](), scope: __module.features/__module.features.10/__module.features.10.block/__module.features.10.block.1/__module.features.10.block.1.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %12 : int = prim::Constant[value=288](), scope: __module.features/__module.features.9/__module.features.9.block/__module.features.9.block.1/__module.features.9.block.1.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %13 : int = prim::Constant[value=144](), scope: __module.features/__module.features.8/__module.features.8.block/__module.features.8.block.1/__module.features.8.block.1.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %14 : int = prim::Constant[value=120](), scope: __module.features/__module.features.7/__module.features.7.block/__module.features.7.block.1/__module.features.7.block.1.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %15 : int = prim::Constant[value=240](), scope: __module.features/__module.features.5/__module.features.5.block/__module.features.5.block.1/__module.features.5.block.1.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %16 : int = prim::Constant[value=96](), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.1/__module.features.4.block.1.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %17 : int = prim::Constant[value=88](), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.1/__module.features.3.block.1.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %18 : int = prim::Constant[value=72](), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.1/__module.features.2.block.1.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %19 : int = prim::Constant[value=16](), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.0/__module.features.1.block.0.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %20 : bool = prim::Constant[value=1](), scope: __module.features/__module.features.0/__module.features.0.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %21 : int = prim::Constant[value=0](), scope: __module.features/__module.features.0/__module.features.0.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %22 : bool = prim::Constant[value=0](), scope: __module.features/__module.features.0/__module.features.0.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %23 : int = prim::Constant[value=1](), scope: __module.features/__module.features.0/__module.features.0.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %24 : int = prim::Constant[value=2](), scope: __module.features/__module.features.0/__module.features.0.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %25 : NoneType = prim::Constant(), scope: __module.features/__module.features.0/__module.features.0.0
  %26 : float = prim::Constant[value=0.001](), scope: __module.features/__module.features.0/__module.features.0.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %27 : float = prim::Constant[value=0.01](), scope: __module.features/__module.features.0/__module.features.0.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %_12 : __torch__.torchvision.ops.misc.___torch_mangle_190.Conv2dNormActivation = prim::GetAttr[name="12"](%features)
  %_11 : __torch__.torchvision.models.mobilenetv3.___torch_mangle_186.InvertedResidual = prim::GetAttr[name="11"](%features)
  %_10 : __torch__.torchvision.models.mobilenetv3.___torch_mangle_167.InvertedResidual = prim::GetAttr[name="10"](%features)
  %_9 : __torch__.torchvision.models.mobilenetv3.___torch_mangle_148.InvertedResidual = prim::GetAttr[name="9"](%features)
  %_8 : __torch__.torchvision.models.mobilenetv3.___torch_mangle_129.InvertedResidual = prim::GetAttr[name="8"](%features)
  %_7 : __torch__.torchvision.models.mobilenetv3.___torch_mangle_110.InvertedResidual = prim::GetAttr[name="7"](%features)
  %_6 : __torch__.torchvision.models.mobilenetv3.___torch_mangle_91.InvertedResidual = prim::GetAttr[name="6"](%features)
  %_5 : __torch__.torchvision.models.mobilenetv3.___torch_mangle_72.InvertedResidual = prim::GetAttr[name="5"](%features)
  %_4 : __torch__.torchvision.models.mobilenetv3.___torch_mangle_53.InvertedResidual = prim::GetAttr[name="4"](%features)
  %_3.1 : __torch__.torchvision.models.mobilenetv3.___torch_mangle_34.InvertedResidual = prim::GetAttr[name="3"](%features)
  %_2.13 : __torch__.torchvision.models.mobilenetv3.___torch_mangle_21.InvertedResidual = prim::GetAttr[name="2"](%features)
  %_1.9 : __torch__.torchvision.models.mobilenetv3.InvertedResidual = prim::GetAttr[name="1"](%features)
  %_0.3 : __torch__.torchvision.ops.misc.Conv2dNormActivation = prim::GetAttr[name="0"](%features)
  %_2.1 : __torch__.torch.nn.modules.activation.Hardswish = prim::GetAttr[name="2"](%_0.3)
  %_1.1 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="1"](%_0.3)
  %_0.1 : __torch__.torch.nn.modules.conv.Conv2d = prim::GetAttr[name="0"](%_0.3)
  %weight.173 : Tensor = prim::GetAttr[name="weight"](%_0.1)
  %45 : int[] = prim::ListConstruct(%24, %24), scope: __module.features/__module.features.0/__module.features.0.0
  %46 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.0/__module.features.0.0
  %47 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.0/__module.features.0.0
  %48 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.0/__module.features.0.0
  %input.1 : Float(1, 16, 112, 112, strides=[200704, 12544, 112, 1], requires_grad=0, device=cpu) = aten::_convolution(%x.1, %weight.173, %25, %45, %46, %47, %22, %48, %23, %22, %22, %20, %20), scope: __module.features/__module.features.0/__module.features.0.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.69 : Tensor = prim::GetAttr[name="running_var"](%_1.1)
  %running_mean.69 : Tensor = prim::GetAttr[name="running_mean"](%_1.1)
  %bias.105 : Tensor = prim::GetAttr[name="bias"](%_1.1)
  %weight.175 : Tensor = prim::GetAttr[name="weight"](%_1.1)
  %input.3 : Float(1, 16, 112, 112, strides=[200704, 12544, 112, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.1, %weight.175, %bias.105, %running_mean.69, %running_var.69, %22, %27, %26, %20), scope: __module.features/__module.features.0/__module.features.0.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.5 : Float(1, 16, 112, 112, strides=[200704, 12544, 112, 1], requires_grad=0, device=cpu) = aten::hardswish_(%input.3), scope: __module.features/__module.features.0/__module.features.0.2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2439:0
  %block.1 : __torch__.torch.nn.modules.container.Sequential = prim::GetAttr[name="block"](%_1.9)
  %_2.5 : __torch__.torchvision.ops.misc.___torch_mangle_8.Conv2dNormActivation = prim::GetAttr[name="2"](%block.1)
  %_1.5 : __torch__.torchvision.ops.misc.SqueezeExcitation = prim::GetAttr[name="1"](%block.1)
  %_0.7 : __torch__.torchvision.ops.misc.___torch_mangle_2.Conv2dNormActivation = prim::GetAttr[name="0"](%block.1)
  %_2.3 : __torch__.torch.nn.modules.activation.ReLU = prim::GetAttr[name="2"](%_0.7)
  %_1.3 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="1"](%_0.7)
  %_0.5 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv2d = prim::GetAttr[name="0"](%_0.7)
  %weight.177 : Tensor = prim::GetAttr[name="weight"](%_0.5)
  %64 : int[] = prim::ListConstruct(%24, %24), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.0/__module.features.1.block.0.0
  %65 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.0/__module.features.1.block.0.0
  %66 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.0/__module.features.1.block.0.0
  %67 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.0/__module.features.1.block.0.0
  %input.7 : Float(1, 16, 56, 56, strides=[50176, 3136, 56, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.5, %weight.177, %25, %64, %65, %66, %22, %67, %19, %22, %22, %20, %20), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.0/__module.features.1.block.0.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.71 : Tensor = prim::GetAttr[name="running_var"](%_1.3)
  %running_mean.71 : Tensor = prim::GetAttr[name="running_mean"](%_1.3)
  %bias.107 : Tensor = prim::GetAttr[name="bias"](%_1.3)
  %weight.179 : Tensor = prim::GetAttr[name="weight"](%_1.3)
  %input.9 : Float(1, 16, 56, 56, strides=[50176, 3136, 56, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.7, %weight.179, %bias.107, %running_mean.71, %running_var.71, %22, %27, %26, %20), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.0/__module.features.1.block.0.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.11 : Float(1, 16, 56, 56, strides=[50176, 3136, 56, 1], requires_grad=0, device=cpu) = aten::relu_(%input.9), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.0/__module.features.1.block.0.2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %scale_activation.1 : __torch__.torch.nn.modules.activation.Hardsigmoid = prim::GetAttr[name="scale_activation"](%_1.5)
  %fc2.1 : __torch__.torch.nn.modules.conv.___torch_mangle_4.Conv2d = prim::GetAttr[name="fc2"](%_1.5)
  %activation.1 : __torch__.torch.nn.modules.activation.___torch_mangle_5.ReLU = prim::GetAttr[name="activation"](%_1.5)
  %fc1.1 : __torch__.torch.nn.modules.conv.___torch_mangle_3.Conv2d = prim::GetAttr[name="fc1"](%_1.5)
  %avgpool.1 : __torch__.torch.nn.modules.pooling.AdaptiveAvgPool2d = prim::GetAttr[name="avgpool"](%_1.5)
  %80 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.1/__module.features.1.block.1.avgpool
  %input.13 : Float(1, 16, 1, 1, strides=[16, 1, 1, 1], requires_grad=0, device=cpu) = aten::adaptive_avg_pool2d(%input.11, %80), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.1/__module.features.1.block.1.avgpool # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1397:0
  %bias.109 : Tensor = prim::GetAttr[name="bias"](%fc1.1)
  %weight.181 : Tensor = prim::GetAttr[name="weight"](%fc1.1)
  %84 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.1/__module.features.1.block.1.fc1
  %85 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.1/__module.features.1.block.1.fc1
  %86 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.1/__module.features.1.block.1.fc1
  %87 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.1/__module.features.1.block.1.fc1
  %input.15 : Float(1, 8, 1, 1, strides=[8, 1, 1, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.13, %weight.181, %bias.109, %84, %85, %86, %22, %87, %23, %22, %22, %20, %20), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.1/__module.features.1.block.1.fc1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %input.17 : Float(1, 8, 1, 1, strides=[8, 1, 1, 1], requires_grad=0, device=cpu) = aten::relu(%input.15), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.1/__module.features.1.block.1.activation # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1721:0
  %bias.111 : Tensor = prim::GetAttr[name="bias"](%fc2.1)
  %weight.183 : Tensor = prim::GetAttr[name="weight"](%fc2.1)
  %92 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.1/__module.features.1.block.1.fc2
  %93 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.1/__module.features.1.block.1.fc2
  %94 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.1/__module.features.1.block.1.fc2
  %95 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.1/__module.features.1.block.1.fc2
  %input.19 : Float(1, 16, 1, 1, strides=[16, 1, 1, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.17, %weight.183, %bias.111, %92, %93, %94, %22, %95, %23, %22, %22, %20, %20), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.1/__module.features.1.block.1.fc2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %scale.1 : Float(1, 16, 1, 1, strides=[16, 1, 1, 1], requires_grad=0, device=cpu) = aten::hardsigmoid(%input.19), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.1/__module.features.1.block.1.scale_activation # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2323:0
  %input.21 : Float(1, 16, 56, 56, strides=[50176, 3136, 56, 1], requires_grad=0, device=cpu) = aten::mul(%scale.1, %input.11), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torchvision/ops/misc.py:261:0
  %_1.7 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_7.BatchNorm2d = prim::GetAttr[name="1"](%_2.5)
  %_0.9 : __torch__.torch.nn.modules.conv.___torch_mangle_6.Conv2d = prim::GetAttr[name="0"](%_2.5)
  %weight.185 : Tensor = prim::GetAttr[name="weight"](%_0.9)
  %102 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.2/__module.features.1.block.2.0
  %103 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.2/__module.features.1.block.2.0
  %104 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.2/__module.features.1.block.2.0
  %105 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.2/__module.features.1.block.2.0
  %input.23 : Float(1, 16, 56, 56, strides=[50176, 3136, 56, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.21, %weight.185, %25, %102, %103, %104, %22, %105, %23, %22, %22, %20, %20), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.2/__module.features.1.block.2.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.73 : Tensor = prim::GetAttr[name="running_var"](%_1.7)
  %running_mean.73 : Tensor = prim::GetAttr[name="running_mean"](%_1.7)
  %bias.113 : Tensor = prim::GetAttr[name="bias"](%_1.7)
  %weight.187 : Tensor = prim::GetAttr[name="weight"](%_1.7)
  %input.25 : Float(1, 16, 56, 56, strides=[50176, 3136, 56, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.23, %weight.187, %bias.113, %running_mean.73, %running_var.73, %22, %27, %26, %20), scope: __module.features/__module.features.1/__module.features.1.block/__module.features.1.block.2/__module.features.1.block.2.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %block.3 : __torch__.torch.nn.modules.container.___torch_mangle_20.Sequential = prim::GetAttr[name="block"](%_2.13)
  %_2.11 : __torch__.torchvision.ops.misc.___torch_mangle_19.Conv2dNormActivation = prim::GetAttr[name="2"](%block.3)
  %_1.15 : __torch__.torchvision.ops.misc.___torch_mangle_16.Conv2dNormActivation = prim::GetAttr[name="1"](%block.3)
  %_0.13 : __torch__.torchvision.ops.misc.___torch_mangle_12.Conv2dNormActivation = prim::GetAttr[name="0"](%block.3)
  %_2.7 : __torch__.torch.nn.modules.activation.___torch_mangle_11.ReLU = prim::GetAttr[name="2"](%_0.13)
  %_1.11 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_10.BatchNorm2d = prim::GetAttr[name="1"](%_0.13)
  %_0.11 : __torch__.torch.nn.modules.conv.___torch_mangle_9.Conv2d = prim::GetAttr[name="0"](%_0.13)
  %weight.189 : Tensor = prim::GetAttr[name="weight"](%_0.11)
  %120 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.0/__module.features.2.block.0.0
  %121 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.0/__module.features.2.block.0.0
  %122 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.0/__module.features.2.block.0.0
  %123 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.0/__module.features.2.block.0.0
  %input.27 : Float(1, 72, 56, 56, strides=[225792, 3136, 56, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.25, %weight.189, %25, %120, %121, %122, %22, %123, %23, %22, %22, %20, %20), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.0/__module.features.2.block.0.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.75 : Tensor = prim::GetAttr[name="running_var"](%_1.11)
  %running_mean.75 : Tensor = prim::GetAttr[name="running_mean"](%_1.11)
  %bias.115 : Tensor = prim::GetAttr[name="bias"](%_1.11)
  %weight.191 : Tensor = prim::GetAttr[name="weight"](%_1.11)
  %input.29 : Float(1, 72, 56, 56, strides=[225792, 3136, 56, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.27, %weight.191, %bias.115, %running_mean.75, %running_var.75, %22, %27, %26, %20), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.0/__module.features.2.block.0.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.31 : Float(1, 72, 56, 56, strides=[225792, 3136, 56, 1], requires_grad=0, device=cpu) = aten::relu_(%input.29), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.0/__module.features.2.block.0.2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %_2.9 : __torch__.torch.nn.modules.activation.___torch_mangle_15.ReLU = prim::GetAttr[name="2"](%_1.15)
  %_1.13 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_14.BatchNorm2d = prim::GetAttr[name="1"](%_1.15)
  %_0.15 : __torch__.torch.nn.modules.conv.___torch_mangle_13.Conv2d = prim::GetAttr[name="0"](%_1.15)
  %weight.193 : Tensor = prim::GetAttr[name="weight"](%_0.15)
  %135 : int[] = prim::ListConstruct(%24, %24), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.1/__module.features.2.block.1.0
  %136 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.1/__module.features.2.block.1.0
  %137 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.1/__module.features.2.block.1.0
  %138 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.1/__module.features.2.block.1.0
  %input.33 : Float(1, 72, 28, 28, strides=[56448, 784, 28, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.31, %weight.193, %25, %135, %136, %137, %22, %138, %18, %22, %22, %20, %20), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.1/__module.features.2.block.1.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.77 : Tensor = prim::GetAttr[name="running_var"](%_1.13)
  %running_mean.77 : Tensor = prim::GetAttr[name="running_mean"](%_1.13)
  %bias.117 : Tensor = prim::GetAttr[name="bias"](%_1.13)
  %weight.195 : Tensor = prim::GetAttr[name="weight"](%_1.13)
  %input.35 : Float(1, 72, 28, 28, strides=[56448, 784, 28, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.33, %weight.195, %bias.117, %running_mean.77, %running_var.77, %22, %27, %26, %20), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.1/__module.features.2.block.1.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.37 : Float(1, 72, 28, 28, strides=[56448, 784, 28, 1], requires_grad=0, device=cpu) = aten::relu_(%input.35), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.1/__module.features.2.block.1.2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %_1.17 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_18.BatchNorm2d = prim::GetAttr[name="1"](%_2.11)
  %_0.17 : __torch__.torch.nn.modules.conv.___torch_mangle_17.Conv2d = prim::GetAttr[name="0"](%_2.11)
  %weight.197 : Tensor = prim::GetAttr[name="weight"](%_0.17)
  %149 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.2/__module.features.2.block.2.0
  %150 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.2/__module.features.2.block.2.0
  %151 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.2/__module.features.2.block.2.0
  %152 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.2/__module.features.2.block.2.0
  %input.39 : Float(1, 24, 28, 28, strides=[18816, 784, 28, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.37, %weight.197, %25, %149, %150, %151, %22, %152, %23, %22, %22, %20, %20), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.2/__module.features.2.block.2.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.79 : Tensor = prim::GetAttr[name="running_var"](%_1.17)
  %running_mean.79 : Tensor = prim::GetAttr[name="running_mean"](%_1.17)
  %bias.119 : Tensor = prim::GetAttr[name="bias"](%_1.17)
  %weight.199 : Tensor = prim::GetAttr[name="weight"](%_1.17)
  %input.41 : Float(1, 24, 28, 28, strides=[18816, 784, 28, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.39, %weight.199, %bias.119, %running_mean.79, %running_var.79, %22, %27, %26, %20), scope: __module.features/__module.features.2/__module.features.2.block/__module.features.2.block.2/__module.features.2.block.2.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %block.5 : __torch__.torch.nn.modules.container.___torch_mangle_33.Sequential = prim::GetAttr[name="block"](%_3.1)
  %_2.19 : __torch__.torchvision.ops.misc.___torch_mangle_32.Conv2dNormActivation = prim::GetAttr[name="2"](%block.5)
  %_1.23 : __torch__.torchvision.ops.misc.___torch_mangle_29.Conv2dNormActivation = prim::GetAttr[name="1"](%block.5)
  %_0.21 : __torch__.torchvision.ops.misc.___torch_mangle_25.Conv2dNormActivation = prim::GetAttr[name="0"](%block.5)
  %_2.15 : __torch__.torch.nn.modules.activation.___torch_mangle_24.ReLU = prim::GetAttr[name="2"](%_0.21)
  %_1.19 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_23.BatchNorm2d = prim::GetAttr[name="1"](%_0.21)
  %_0.19 : __torch__.torch.nn.modules.conv.___torch_mangle_22.Conv2d = prim::GetAttr[name="0"](%_0.21)
  %weight.201 : Tensor = prim::GetAttr[name="weight"](%_0.19)
  %167 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.0/__module.features.3.block.0.0
  %168 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.0/__module.features.3.block.0.0
  %169 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.0/__module.features.3.block.0.0
  %170 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.0/__module.features.3.block.0.0
  %input.43 : Float(1, 88, 28, 28, strides=[68992, 784, 28, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.41, %weight.201, %25, %167, %168, %169, %22, %170, %23, %22, %22, %20, %20), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.0/__module.features.3.block.0.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.81 : Tensor = prim::GetAttr[name="running_var"](%_1.19)
  %running_mean.81 : Tensor = prim::GetAttr[name="running_mean"](%_1.19)
  %bias.121 : Tensor = prim::GetAttr[name="bias"](%_1.19)
  %weight.203 : Tensor = prim::GetAttr[name="weight"](%_1.19)
  %input.45 : Float(1, 88, 28, 28, strides=[68992, 784, 28, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.43, %weight.203, %bias.121, %running_mean.81, %running_var.81, %22, %27, %26, %20), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.0/__module.features.3.block.0.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.47 : Float(1, 88, 28, 28, strides=[68992, 784, 28, 1], requires_grad=0, device=cpu) = aten::relu_(%input.45), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.0/__module.features.3.block.0.2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %_2.17 : __torch__.torch.nn.modules.activation.___torch_mangle_28.ReLU = prim::GetAttr[name="2"](%_1.23)
  %_1.21 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_27.BatchNorm2d = prim::GetAttr[name="1"](%_1.23)
  %_0.23 : __torch__.torch.nn.modules.conv.___torch_mangle_26.Conv2d = prim::GetAttr[name="0"](%_1.23)
  %weight.205 : Tensor = prim::GetAttr[name="weight"](%_0.23)
  %182 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.1/__module.features.3.block.1.0
  %183 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.1/__module.features.3.block.1.0
  %184 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.1/__module.features.3.block.1.0
  %185 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.1/__module.features.3.block.1.0
  %input.49 : Float(1, 88, 28, 28, strides=[68992, 784, 28, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.47, %weight.205, %25, %182, %183, %184, %22, %185, %17, %22, %22, %20, %20), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.1/__module.features.3.block.1.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.83 : Tensor = prim::GetAttr[name="running_var"](%_1.21)
  %running_mean.83 : Tensor = prim::GetAttr[name="running_mean"](%_1.21)
  %bias.123 : Tensor = prim::GetAttr[name="bias"](%_1.21)
  %weight.207 : Tensor = prim::GetAttr[name="weight"](%_1.21)
  %input.51 : Float(1, 88, 28, 28, strides=[68992, 784, 28, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.49, %weight.207, %bias.123, %running_mean.83, %running_var.83, %22, %27, %26, %20), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.1/__module.features.3.block.1.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.53 : Float(1, 88, 28, 28, strides=[68992, 784, 28, 1], requires_grad=0, device=cpu) = aten::relu_(%input.51), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.1/__module.features.3.block.1.2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %_1.25 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_31.BatchNorm2d = prim::GetAttr[name="1"](%_2.19)
  %_0.25 : __torch__.torch.nn.modules.conv.___torch_mangle_30.Conv2d = prim::GetAttr[name="0"](%_2.19)
  %weight.209 : Tensor = prim::GetAttr[name="weight"](%_0.25)
  %196 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.2/__module.features.3.block.2.0
  %197 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.2/__module.features.3.block.2.0
  %198 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.2/__module.features.3.block.2.0
  %199 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.2/__module.features.3.block.2.0
  %input.55 : Float(1, 24, 28, 28, strides=[18816, 784, 28, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.53, %weight.209, %25, %196, %197, %198, %22, %199, %23, %22, %22, %20, %20), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.2/__module.features.3.block.2.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.85 : Tensor = prim::GetAttr[name="running_var"](%_1.25)
  %running_mean.85 : Tensor = prim::GetAttr[name="running_mean"](%_1.25)
  %bias.125 : Tensor = prim::GetAttr[name="bias"](%_1.25)
  %weight.211 : Tensor = prim::GetAttr[name="weight"](%_1.25)
  %result.1 : Float(1, 24, 28, 28, strides=[18816, 784, 28, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.55, %weight.211, %bias.125, %running_mean.85, %running_var.85, %22, %27, %26, %20), scope: __module.features/__module.features.3/__module.features.3.block/__module.features.3.block.2/__module.features.3.block.2.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.57 : Float(1, 24, 28, 28, strides=[18816, 784, 28, 1], requires_grad=0, device=cpu) = aten::add_(%result.1, %input.41, %23), scope: __module.features/__module.features.3 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torchvision/models/mobilenetv3.py:114:0
  %block.7 : __torch__.torch.nn.modules.container.___torch_mangle_52.Sequential = prim::GetAttr[name="block"](%_4)
  %_3.3 : __torch__.torchvision.ops.misc.___torch_mangle_51.Conv2dNormActivation = prim::GetAttr[name="3"](%block.7)
  %_2.25 : __torch__.torchvision.ops.misc.___torch_mangle_48.SqueezeExcitation = prim::GetAttr[name="2"](%block.7)
  %_1.31 : __torch__.torchvision.ops.misc.___torch_mangle_42.Conv2dNormActivation = prim::GetAttr[name="1"](%block.7)
  %_0.29 : __torch__.torchvision.ops.misc.___torch_mangle_38.Conv2dNormActivation = prim::GetAttr[name="0"](%block.7)
  %_2.21 : __torch__.torch.nn.modules.activation.___torch_mangle_37.Hardswish = prim::GetAttr[name="2"](%_0.29)
  %_1.27 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_36.BatchNorm2d = prim::GetAttr[name="1"](%_0.29)
  %_0.27 : __torch__.torch.nn.modules.conv.___torch_mangle_35.Conv2d = prim::GetAttr[name="0"](%_0.29)
  %weight.213 : Tensor = prim::GetAttr[name="weight"](%_0.27)
  %216 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.0/__module.features.4.block.0.0
  %217 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.0/__module.features.4.block.0.0
  %218 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.0/__module.features.4.block.0.0
  %219 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.0/__module.features.4.block.0.0
  %input.59 : Float(1, 96, 28, 28, strides=[75264, 784, 28, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.57, %weight.213, %25, %216, %217, %218, %22, %219, %23, %22, %22, %20, %20), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.0/__module.features.4.block.0.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.87 : Tensor = prim::GetAttr[name="running_var"](%_1.27)
  %running_mean.87 : Tensor = prim::GetAttr[name="running_mean"](%_1.27)
  %bias.127 : Tensor = prim::GetAttr[name="bias"](%_1.27)
  %weight.215 : Tensor = prim::GetAttr[name="weight"](%_1.27)
  %input.61 : Float(1, 96, 28, 28, strides=[75264, 784, 28, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.59, %weight.215, %bias.127, %running_mean.87, %running_var.87, %22, %27, %26, %20), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.0/__module.features.4.block.0.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.63 : Float(1, 96, 28, 28, strides=[75264, 784, 28, 1], requires_grad=0, device=cpu) = aten::hardswish_(%input.61), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.0/__module.features.4.block.0.2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2439:0
  %_2.23 : __torch__.torch.nn.modules.activation.___torch_mangle_41.Hardswish = prim::GetAttr[name="2"](%_1.31)
  %_1.29 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_40.BatchNorm2d = prim::GetAttr[name="1"](%_1.31)
  %_0.31 : __torch__.torch.nn.modules.conv.___torch_mangle_39.Conv2d = prim::GetAttr[name="0"](%_1.31)
  %weight.217 : Tensor = prim::GetAttr[name="weight"](%_0.31)
  %231 : int[] = prim::ListConstruct(%24, %24), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.1/__module.features.4.block.1.0
  %232 : int[] = prim::ListConstruct(%24, %24), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.1/__module.features.4.block.1.0
  %233 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.1/__module.features.4.block.1.0
  %234 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.1/__module.features.4.block.1.0
  %input.65 : Float(1, 96, 14, 14, strides=[18816, 196, 14, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.63, %weight.217, %25, %231, %232, %233, %22, %234, %16, %22, %22, %20, %20), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.1/__module.features.4.block.1.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.89 : Tensor = prim::GetAttr[name="running_var"](%_1.29)
  %running_mean.89 : Tensor = prim::GetAttr[name="running_mean"](%_1.29)
  %bias.129 : Tensor = prim::GetAttr[name="bias"](%_1.29)
  %weight.219 : Tensor = prim::GetAttr[name="weight"](%_1.29)
  %input.67 : Float(1, 96, 14, 14, strides=[18816, 196, 14, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.65, %weight.219, %bias.129, %running_mean.89, %running_var.89, %22, %27, %26, %20), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.1/__module.features.4.block.1.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.69 : Float(1, 96, 14, 14, strides=[18816, 196, 14, 1], requires_grad=0, device=cpu) = aten::hardswish_(%input.67), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.1/__module.features.4.block.1.2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2439:0
  %scale_activation.3 : __torch__.torch.nn.modules.activation.___torch_mangle_47.Hardsigmoid = prim::GetAttr[name="scale_activation"](%_2.25)
  %fc2.3 : __torch__.torch.nn.modules.conv.___torch_mangle_45.Conv2d = prim::GetAttr[name="fc2"](%_2.25)
  %activation.3 : __torch__.torch.nn.modules.activation.___torch_mangle_46.ReLU = prim::GetAttr[name="activation"](%_2.25)
  %fc1.3 : __torch__.torch.nn.modules.conv.___torch_mangle_44.Conv2d = prim::GetAttr[name="fc1"](%_2.25)
  %avgpool.3 : __torch__.torch.nn.modules.pooling.___torch_mangle_43.AdaptiveAvgPool2d = prim::GetAttr[name="avgpool"](%_2.25)
  %247 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.2/__module.features.4.block.2.avgpool
  %input.71 : Float(1, 96, 1, 1, strides=[96, 1, 1, 1], requires_grad=0, device=cpu) = aten::adaptive_avg_pool2d(%input.69, %247), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.2/__module.features.4.block.2.avgpool # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1397:0
  %bias.131 : Tensor = prim::GetAttr[name="bias"](%fc1.3)
  %weight.221 : Tensor = prim::GetAttr[name="weight"](%fc1.3)
  %251 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.2/__module.features.4.block.2.fc1
  %252 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.2/__module.features.4.block.2.fc1
  %253 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.2/__module.features.4.block.2.fc1
  %254 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.2/__module.features.4.block.2.fc1
  %input.73 : Float(1, 24, 1, 1, strides=[24, 1, 1, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.71, %weight.221, %bias.131, %251, %252, %253, %22, %254, %23, %22, %22, %20, %20), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.2/__module.features.4.block.2.fc1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %input.75 : Float(1, 24, 1, 1, strides=[24, 1, 1, 1], requires_grad=0, device=cpu) = aten::relu(%input.73), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.2/__module.features.4.block.2.activation # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1721:0
  %bias.133 : Tensor = prim::GetAttr[name="bias"](%fc2.3)
  %weight.223 : Tensor = prim::GetAttr[name="weight"](%fc2.3)
  %259 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.2/__module.features.4.block.2.fc2
  %260 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.2/__module.features.4.block.2.fc2
  %261 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.2/__module.features.4.block.2.fc2
  %262 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.2/__module.features.4.block.2.fc2
  %input.77 : Float(1, 96, 1, 1, strides=[96, 1, 1, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.75, %weight.223, %bias.133, %259, %260, %261, %22, %262, %23, %22, %22, %20, %20), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.2/__module.features.4.block.2.fc2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %scale.3 : Float(1, 96, 1, 1, strides=[96, 1, 1, 1], requires_grad=0, device=cpu) = aten::hardsigmoid(%input.77), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.2/__module.features.4.block.2.scale_activation # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2323:0
  %input.79 : Float(1, 96, 14, 14, strides=[18816, 196, 14, 1], requires_grad=0, device=cpu) = aten::mul(%scale.3, %input.69), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torchvision/ops/misc.py:261:0
  %_1.33 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_50.BatchNorm2d = prim::GetAttr[name="1"](%_3.3)
  %_0.33 : __torch__.torch.nn.modules.conv.___torch_mangle_49.Conv2d = prim::GetAttr[name="0"](%_3.3)
  %weight.225 : Tensor = prim::GetAttr[name="weight"](%_0.33)
  %269 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.3/__module.features.4.block.3.0
  %270 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.3/__module.features.4.block.3.0
  %271 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.3/__module.features.4.block.3.0
  %272 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.3/__module.features.4.block.3.0
  %input.81 : Float(1, 40, 14, 14, strides=[7840, 196, 14, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.79, %weight.225, %25, %269, %270, %271, %22, %272, %23, %22, %22, %20, %20), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.3/__module.features.4.block.3.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.91 : Tensor = prim::GetAttr[name="running_var"](%_1.33)
  %running_mean.91 : Tensor = prim::GetAttr[name="running_mean"](%_1.33)
  %bias.135 : Tensor = prim::GetAttr[name="bias"](%_1.33)
  %weight.227 : Tensor = prim::GetAttr[name="weight"](%_1.33)
  %input.83 : Float(1, 40, 14, 14, strides=[7840, 196, 14, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.81, %weight.227, %bias.135, %running_mean.91, %running_var.91, %22, %27, %26, %20), scope: __module.features/__module.features.4/__module.features.4.block/__module.features.4.block.3/__module.features.4.block.3.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %block.9 : __torch__.torch.nn.modules.container.___torch_mangle_71.Sequential = prim::GetAttr[name="block"](%_5)
  %_3.5 : __torch__.torchvision.ops.misc.___torch_mangle_70.Conv2dNormActivation = prim::GetAttr[name="3"](%block.9)
  %_2.31 : __torch__.torchvision.ops.misc.___torch_mangle_67.SqueezeExcitation = prim::GetAttr[name="2"](%block.9)
  %_1.39 : __torch__.torchvision.ops.misc.___torch_mangle_61.Conv2dNormActivation = prim::GetAttr[name="1"](%block.9)
  %_0.37 : __torch__.torchvision.ops.misc.___torch_mangle_57.Conv2dNormActivation = prim::GetAttr[name="0"](%block.9)
  %_2.27 : __torch__.torch.nn.modules.activation.___torch_mangle_56.Hardswish = prim::GetAttr[name="2"](%_0.37)
  %_1.35 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_55.BatchNorm2d = prim::GetAttr[name="1"](%_0.37)
  %_0.35 : __torch__.torch.nn.modules.conv.___torch_mangle_54.Conv2d = prim::GetAttr[name="0"](%_0.37)
  %weight.229 : Tensor = prim::GetAttr[name="weight"](%_0.35)
  %288 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.5/__module.features.5.block/__module.features.5.block.0/__module.features.5.block.0.0
  %289 : int[] = prim::ListConstruct(%21, %21), scope: __module.features/__module.features.5/__module.features.5.block/__module.features.5.block.0/__module.features.5.block.0.0
  %290 : int[] = prim::ListConstruct(%23, %23), scope: __module.features/__module.features.5/__module.features.5.block/__module.features.5.block.0/__module.features.5.block.0.0
