graph(%self.1 : __torch__.torchvision.models.resnet.ResNet,
      %x.1 : Float(1, 3, 224, 224, strides=[150528, 50176, 224, 1], requires_grad=0, device=cpu)):
  %fc : __torch__.torch.nn.modules.linear.Linear = prim::GetAttr[name="fc"](%self.1)
  %avgpool : __torch__.torch.nn.modules.pooling.AdaptiveAvgPool2d = prim::GetAttr[name="avgpool"](%self.1)
  %layer4 : __torch__.torch.nn.modules.container.___torch_mangle_277.Sequential = prim::GetAttr[name="layer4"](%self.1)
  %layer3 : __torch__.torch.nn.modules.container.___torch_mangle_249.Sequential = prim::GetAttr[name="layer3"](%self.1)
  %layer2 : __torch__.torch.nn.modules.container.___torch_mangle_61.Sequential = prim::GetAttr[name="layer2"](%self.1)
  %layer1 : __torch__.torch.nn.modules.container.___torch_mangle_25.Sequential = prim::GetAttr[name="layer1"](%self.1)
  %maxpool : __torch__.torch.nn.modules.pooling.MaxPool2d = prim::GetAttr[name="maxpool"](%self.1)
  %relu.1 : __torch__.torch.nn.modules.activation.ReLU = prim::GetAttr[name="relu"](%self.1)
  %bn1.1 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="bn1"](%self.1)
  %conv1.1 : __torch__.torch.nn.modules.conv.Conv2d = prim::GetAttr[name="conv1"](%self.1)
  %25 : bool = prim::Constant[value=1](), scope: __module.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %26 : int = prim::Constant[value=0](), scope: __module.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %27 : bool = prim::Constant[value=0](), scope: __module.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %28 : int = prim::Constant[value=1](), scope: __module.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %29 : int = prim::Constant[value=3](), scope: __module.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %30 : int = prim::Constant[value=2](), scope: __module.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %31 : NoneType = prim::Constant(), scope: __module.conv1
  %weight.417 : Tensor = prim::GetAttr[name="weight"](%conv1.1)
  %33 : int[] = prim::ListConstruct(%30, %30), scope: __module.conv1
  %34 : int[] = prim::ListConstruct(%29, %29), scope: __module.conv1
  %35 : int[] = prim::ListConstruct(%28, %28), scope: __module.conv1
  %36 : int[] = prim::ListConstruct(%26, %26), scope: __module.conv1
  %input.1 : Float(1, 64, 112, 112, strides=[802816, 12544, 112, 1], requires_grad=0, device=cpu) = aten::_convolution(%x.1, %weight.417, %31, %33, %34, %35, %27, %36, %28, %27, %27, %25, %25), scope: __module.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %38 : bool = prim::Constant[value=1](), scope: __module.bn1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %39 : float = prim::Constant[value=1.0000000000000001e-05](), scope: __module.bn1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %40 : float = prim::Constant[value=0.10000000000000001](), scope: __module.bn1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %41 : bool = prim::Constant[value=0](), scope: __module.bn1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %running_var.209 : Tensor = prim::GetAttr[name="running_var"](%bn1.1)
  %running_mean.209 : Tensor = prim::GetAttr[name="running_mean"](%bn1.1)
  %bias.209 : Tensor = prim::GetAttr[name="bias"](%bn1.1)
  %weight.419 : Tensor = prim::GetAttr[name="weight"](%bn1.1)
  %input.3 : Float(1, 64, 112, 112, strides=[802816, 12544, 112, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.1, %weight.419, %bias.209, %running_mean.209, %running_var.209, %41, %40, %39, %38), scope: __module.bn1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.5 : Float(1, 64, 112, 112, strides=[802816, 12544, 112, 1], requires_grad=0, device=cpu) = aten::relu_(%input.3), scope: __module.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %48 : bool = prim::Constant[value=0](), scope: __module.maxpool # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:833:0
  %49 : int = prim::Constant[value=1](), scope: __module.maxpool # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:833:0
  %50 : int = prim::Constant[value=2](), scope: __module.maxpool # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:833:0
  %51 : int = prim::Constant[value=3](), scope: __module.maxpool # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:833:0
  %52 : int[] = prim::ListConstruct(%51, %51), scope: __module.maxpool
  %53 : int[] = prim::ListConstruct(%50, %50), scope: __module.maxpool
  %54 : int[] = prim::ListConstruct(%49, %49), scope: __module.maxpool
  %55 : int[] = prim::ListConstruct(%49, %49), scope: __module.maxpool
  %input.7 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::max_pool2d(%input.5, %52, %53, %54, %55, %48), scope: __module.maxpool # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:833:0
  %57 : bool = prim::Constant[value=1](), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %58 : bool = prim::Constant[value=0](), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %59 : int = prim::Constant[value=0](), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %60 : int = prim::Constant[value=1](), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %61 : NoneType = prim::Constant(), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv1
  %62 : float = prim::Constant[value=1.0000000000000001e-05](), scope: __module.layer1/__module.layer1.0/__module.layer1.0.bn1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %63 : float = prim::Constant[value=0.10000000000000001](), scope: __module.layer1/__module.layer1.0/__module.layer1.0.bn1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %_2.1 : __torch__.torchvision.models.resnet.___torch_mangle_24.Bottleneck = prim::GetAttr[name="2"](%layer1)
  %_1.3 : __torch__.torchvision.models.resnet.___torch_mangle_16.Bottleneck = prim::GetAttr[name="1"](%layer1)
  %_0.3 : __torch__.torchvision.models.resnet.Bottleneck = prim::GetAttr[name="0"](%layer1)
  %downsample.1 : __torch__.torch.nn.modules.container.Sequential = prim::GetAttr[name="downsample"](%_0.3)
  %bn3.1 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_5.BatchNorm2d = prim::GetAttr[name="bn3"](%_0.3)
  %conv3.1 : __torch__.torch.nn.modules.conv.___torch_mangle_4.Conv2d = prim::GetAttr[name="conv3"](%_0.3)
  %bn2.1 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_3.BatchNorm2d = prim::GetAttr[name="bn2"](%_0.3)
  %conv2.1 : __torch__.torch.nn.modules.conv.___torch_mangle_2.Conv2d = prim::GetAttr[name="conv2"](%_0.3)
  %relu.3 : __torch__.torch.nn.modules.activation.___torch_mangle_6.ReLU = prim::GetAttr[name="relu"](%_0.3)
  %bn1.3 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_1.BatchNorm2d = prim::GetAttr[name="bn1"](%_0.3)
  %conv1.3 : __torch__.torch.nn.modules.conv.___torch_mangle_0.Conv2d = prim::GetAttr[name="conv1"](%_0.3)
  %weight.421 : Tensor = prim::GetAttr[name="weight"](%conv1.3)
  %76 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv1
  %77 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv1
  %78 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv1
  %79 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv1
  %input.9 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.7, %weight.421, %61, %76, %77, %78, %58, %79, %60, %58, %58, %57, %57), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.211 : Tensor = prim::GetAttr[name="running_var"](%bn1.3)
  %running_mean.211 : Tensor = prim::GetAttr[name="running_mean"](%bn1.3)
  %bias.211 : Tensor = prim::GetAttr[name="bias"](%bn1.3)
  %weight.423 : Tensor = prim::GetAttr[name="weight"](%bn1.3)
  %input.11 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.9, %weight.423, %bias.211, %running_mean.211, %running_var.211, %58, %63, %62, %57), scope: __module.layer1/__module.layer1.0/__module.layer1.0.bn1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.13 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::relu_(%input.11), scope: __module.layer1/__module.layer1.0/__module.layer1.0.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %weight.425 : Tensor = prim::GetAttr[name="weight"](%conv2.1)
  %88 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv2
  %89 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv2
  %90 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv2
  %91 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv2
  %input.15 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.13, %weight.425, %61, %88, %89, %90, %58, %91, %60, %58, %58, %57, %57), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.213 : Tensor = prim::GetAttr[name="running_var"](%bn2.1)
  %running_mean.213 : Tensor = prim::GetAttr[name="running_mean"](%bn2.1)
  %bias.213 : Tensor = prim::GetAttr[name="bias"](%bn2.1)
  %weight.427 : Tensor = prim::GetAttr[name="weight"](%bn2.1)
  %input.17 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.15, %weight.427, %bias.213, %running_mean.213, %running_var.213, %58, %63, %62, %57), scope: __module.layer1/__module.layer1.0/__module.layer1.0.bn2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.19 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::relu_(%input.17), scope: __module.layer1/__module.layer1.0/__module.layer1.0.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %weight.429 : Tensor = prim::GetAttr[name="weight"](%conv3.1)
  %100 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv3
  %101 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv3
  %102 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv3
  %103 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv3
  %input.21 : Float(1, 256, 56, 56, strides=[802816, 3136, 56, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.19, %weight.429, %61, %100, %101, %102, %58, %103, %60, %58, %58, %57, %57), scope: __module.layer1/__module.layer1.0/__module.layer1.0.conv3 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.215 : Tensor = prim::GetAttr[name="running_var"](%bn3.1)
  %running_mean.215 : Tensor = prim::GetAttr[name="running_mean"](%bn3.1)
  %bias.215 : Tensor = prim::GetAttr[name="bias"](%bn3.1)
  %weight.431 : Tensor = prim::GetAttr[name="weight"](%bn3.1)
  %out.1 : Float(1, 256, 56, 56, strides=[802816, 3136, 56, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.21, %weight.431, %bias.215, %running_mean.215, %running_var.215, %58, %63, %62, %57), scope: __module.layer1/__module.layer1.0/__module.layer1.0.bn3 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %_1.1 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_8.BatchNorm2d = prim::GetAttr[name="1"](%downsample.1)
  %_0.1 : __torch__.torch.nn.modules.conv.___torch_mangle_7.Conv2d = prim::GetAttr[name="0"](%downsample.1)
  %weight.433 : Tensor = prim::GetAttr[name="weight"](%_0.1)
  %113 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.0/__module.layer1.0.downsample/__module.layer1.0.downsample.0
  %114 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.0/__module.layer1.0.downsample/__module.layer1.0.downsample.0
  %115 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.0/__module.layer1.0.downsample/__module.layer1.0.downsample.0
  %116 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.0/__module.layer1.0.downsample/__module.layer1.0.downsample.0
  %input.23 : Float(1, 256, 56, 56, strides=[802816, 3136, 56, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.7, %weight.433, %61, %113, %114, %115, %58, %116, %60, %58, %58, %57, %57), scope: __module.layer1/__module.layer1.0/__module.layer1.0.downsample/__module.layer1.0.downsample.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.217 : Tensor = prim::GetAttr[name="running_var"](%_1.1)
  %running_mean.217 : Tensor = prim::GetAttr[name="running_mean"](%_1.1)
  %bias.217 : Tensor = prim::GetAttr[name="bias"](%_1.1)
  %weight.435 : Tensor = prim::GetAttr[name="weight"](%_1.1)
  %identity.1 : Float(1, 256, 56, 56, strides=[802816, 3136, 56, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.23, %weight.435, %bias.217, %running_mean.217, %running_var.217, %58, %63, %62, %57), scope: __module.layer1/__module.layer1.0/__module.layer1.0.downsample/__module.layer1.0.downsample.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.25 : Float(1, 256, 56, 56, strides=[802816, 3136, 56, 1], requires_grad=0, device=cpu) = aten::add_(%out.1, %identity.1, %60), scope: __module.layer1/__module.layer1.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torchvision/models/resnet.py:160:0
  %input.27 : Float(1, 256, 56, 56, strides=[802816, 3136, 56, 1], requires_grad=0, device=cpu) = aten::relu_(%input.25), scope: __module.layer1/__module.layer1.0/__module.layer1.0.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %bn3.3 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_14.BatchNorm2d = prim::GetAttr[name="bn3"](%_1.3)
  %conv3.3 : __torch__.torch.nn.modules.conv.___torch_mangle_13.Conv2d = prim::GetAttr[name="conv3"](%_1.3)
  %bn2.3 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_12.BatchNorm2d = prim::GetAttr[name="bn2"](%_1.3)
  %conv2.3 : __torch__.torch.nn.modules.conv.___torch_mangle_11.Conv2d = prim::GetAttr[name="conv2"](%_1.3)
  %relu.5 : __torch__.torch.nn.modules.activation.___torch_mangle_15.ReLU = prim::GetAttr[name="relu"](%_1.3)
  %bn1.5 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_10.BatchNorm2d = prim::GetAttr[name="bn1"](%_1.3)
  %conv1.5 : __torch__.torch.nn.modules.conv.___torch_mangle_9.Conv2d = prim::GetAttr[name="conv1"](%_1.3)
  %weight.437 : Tensor = prim::GetAttr[name="weight"](%conv1.5)
  %133 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.1/__module.layer1.1.conv1
  %134 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.1/__module.layer1.1.conv1
  %135 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.1/__module.layer1.1.conv1
  %136 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.1/__module.layer1.1.conv1
  %input.29 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.27, %weight.437, %61, %133, %134, %135, %58, %136, %60, %58, %58, %57, %57), scope: __module.layer1/__module.layer1.1/__module.layer1.1.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.219 : Tensor = prim::GetAttr[name="running_var"](%bn1.5)
  %running_mean.219 : Tensor = prim::GetAttr[name="running_mean"](%bn1.5)
  %bias.219 : Tensor = prim::GetAttr[name="bias"](%bn1.5)
  %weight.439 : Tensor = prim::GetAttr[name="weight"](%bn1.5)
  %input.31 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.29, %weight.439, %bias.219, %running_mean.219, %running_var.219, %58, %63, %62, %57), scope: __module.layer1/__module.layer1.1/__module.layer1.1.bn1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.33 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::relu_(%input.31), scope: __module.layer1/__module.layer1.1/__module.layer1.1.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %weight.441 : Tensor = prim::GetAttr[name="weight"](%conv2.3)
  %145 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.1/__module.layer1.1.conv2
  %146 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.1/__module.layer1.1.conv2
  %147 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.1/__module.layer1.1.conv2
  %148 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.1/__module.layer1.1.conv2
  %input.35 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.33, %weight.441, %61, %145, %146, %147, %58, %148, %60, %58, %58, %57, %57), scope: __module.layer1/__module.layer1.1/__module.layer1.1.conv2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.221 : Tensor = prim::GetAttr[name="running_var"](%bn2.3)
  %running_mean.221 : Tensor = prim::GetAttr[name="running_mean"](%bn2.3)
  %bias.221 : Tensor = prim::GetAttr[name="bias"](%bn2.3)
  %weight.443 : Tensor = prim::GetAttr[name="weight"](%bn2.3)
  %input.37 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.35, %weight.443, %bias.221, %running_mean.221, %running_var.221, %58, %63, %62, %57), scope: __module.layer1/__module.layer1.1/__module.layer1.1.bn2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.39 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::relu_(%input.37), scope: __module.layer1/__module.layer1.1/__module.layer1.1.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %weight.445 : Tensor = prim::GetAttr[name="weight"](%conv3.3)
  %157 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.1/__module.layer1.1.conv3
  %158 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.1/__module.layer1.1.conv3
  %159 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.1/__module.layer1.1.conv3
  %160 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.1/__module.layer1.1.conv3
  %input.41 : Float(1, 256, 56, 56, strides=[802816, 3136, 56, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.39, %weight.445, %61, %157, %158, %159, %58, %160, %60, %58, %58, %57, %57), scope: __module.layer1/__module.layer1.1/__module.layer1.1.conv3 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.223 : Tensor = prim::GetAttr[name="running_var"](%bn3.3)
  %running_mean.223 : Tensor = prim::GetAttr[name="running_mean"](%bn3.3)
  %bias.223 : Tensor = prim::GetAttr[name="bias"](%bn3.3)
  %weight.447 : Tensor = prim::GetAttr[name="weight"](%bn3.3)
  %out.3 : Float(1, 256, 56, 56, strides=[802816, 3136, 56, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.41, %weight.447, %bias.223, %running_mean.223, %running_var.223, %58, %63, %62, %57), scope: __module.layer1/__module.layer1.1/__module.layer1.1.bn3 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.43 : Float(1, 256, 56, 56, strides=[802816, 3136, 56, 1], requires_grad=0, device=cpu) = aten::add_(%out.3, %input.27, %60), scope: __module.layer1/__module.layer1.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torchvision/models/resnet.py:160:0
  %input.45 : Float(1, 256, 56, 56, strides=[802816, 3136, 56, 1], requires_grad=0, device=cpu) = aten::relu_(%input.43), scope: __module.layer1/__module.layer1.1/__module.layer1.1.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %bn3.5 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_22.BatchNorm2d = prim::GetAttr[name="bn3"](%_2.1)
  %conv3.5 : __torch__.torch.nn.modules.conv.___torch_mangle_21.Conv2d = prim::GetAttr[name="conv3"](%_2.1)
  %bn2.5 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_20.BatchNorm2d = prim::GetAttr[name="bn2"](%_2.1)
  %conv2.5 : __torch__.torch.nn.modules.conv.___torch_mangle_19.Conv2d = prim::GetAttr[name="conv2"](%_2.1)
  %relu.7 : __torch__.torch.nn.modules.activation.___torch_mangle_23.ReLU = prim::GetAttr[name="relu"](%_2.1)
  %bn1.7 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_18.BatchNorm2d = prim::GetAttr[name="bn1"](%_2.1)
  %conv1.7 : __torch__.torch.nn.modules.conv.___torch_mangle_17.Conv2d = prim::GetAttr[name="conv1"](%_2.1)
  %weight.449 : Tensor = prim::GetAttr[name="weight"](%conv1.7)
  %177 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.2/__module.layer1.2.conv1
  %178 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.2/__module.layer1.2.conv1
  %179 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.2/__module.layer1.2.conv1
  %180 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.2/__module.layer1.2.conv1
  %input.47 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.45, %weight.449, %61, %177, %178, %179, %58, %180, %60, %58, %58, %57, %57), scope: __module.layer1/__module.layer1.2/__module.layer1.2.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.225 : Tensor = prim::GetAttr[name="running_var"](%bn1.7)
  %running_mean.225 : Tensor = prim::GetAttr[name="running_mean"](%bn1.7)
  %bias.225 : Tensor = prim::GetAttr[name="bias"](%bn1.7)
  %weight.451 : Tensor = prim::GetAttr[name="weight"](%bn1.7)
  %input.49 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.47, %weight.451, %bias.225, %running_mean.225, %running_var.225, %58, %63, %62, %57), scope: __module.layer1/__module.layer1.2/__module.layer1.2.bn1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.51 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::relu_(%input.49), scope: __module.layer1/__module.layer1.2/__module.layer1.2.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %weight.453 : Tensor = prim::GetAttr[name="weight"](%conv2.5)
  %189 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.2/__module.layer1.2.conv2
  %190 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.2/__module.layer1.2.conv2
  %191 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.2/__module.layer1.2.conv2
  %192 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.2/__module.layer1.2.conv2
  %input.53 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.51, %weight.453, %61, %189, %190, %191, %58, %192, %60, %58, %58, %57, %57), scope: __module.layer1/__module.layer1.2/__module.layer1.2.conv2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.227 : Tensor = prim::GetAttr[name="running_var"](%bn2.5)
  %running_mean.227 : Tensor = prim::GetAttr[name="running_mean"](%bn2.5)
  %bias.227 : Tensor = prim::GetAttr[name="bias"](%bn2.5)
  %weight.455 : Tensor = prim::GetAttr[name="weight"](%bn2.5)
  %input.55 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.53, %weight.455, %bias.227, %running_mean.227, %running_var.227, %58, %63, %62, %57), scope: __module.layer1/__module.layer1.2/__module.layer1.2.bn2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.57 : Float(1, 64, 56, 56, strides=[200704, 3136, 56, 1], requires_grad=0, device=cpu) = aten::relu_(%input.55), scope: __module.layer1/__module.layer1.2/__module.layer1.2.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %weight.457 : Tensor = prim::GetAttr[name="weight"](%conv3.5)
  %201 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.2/__module.layer1.2.conv3
  %202 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.2/__module.layer1.2.conv3
  %203 : int[] = prim::ListConstruct(%60, %60), scope: __module.layer1/__module.layer1.2/__module.layer1.2.conv3
  %204 : int[] = prim::ListConstruct(%59, %59), scope: __module.layer1/__module.layer1.2/__module.layer1.2.conv3
  %input.59 : Float(1, 256, 56, 56, strides=[802816, 3136, 56, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.57, %weight.457, %61, %201, %202, %203, %58, %204, %60, %58, %58, %57, %57), scope: __module.layer1/__module.layer1.2/__module.layer1.2.conv3 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.229 : Tensor = prim::GetAttr[name="running_var"](%bn3.5)
  %running_mean.229 : Tensor = prim::GetAttr[name="running_mean"](%bn3.5)
  %bias.229 : Tensor = prim::GetAttr[name="bias"](%bn3.5)
  %weight.459 : Tensor = prim::GetAttr[name="weight"](%bn3.5)
  %out.5 : Float(1, 256, 56, 56, strides=[802816, 3136, 56, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.59, %weight.459, %bias.229, %running_mean.229, %running_var.229, %58, %63, %62, %57), scope: __module.layer1/__module.layer1.2/__module.layer1.2.bn3 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.61 : Float(1, 256, 56, 56, strides=[802816, 3136, 56, 1], requires_grad=0, device=cpu) = aten::add_(%out.5, %input.45, %60), scope: __module.layer1/__module.layer1.2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torchvision/models/resnet.py:160:0
  %input.63 : Float(1, 256, 56, 56, strides=[802816, 3136, 56, 1], requires_grad=0, device=cpu) = aten::relu_(%input.61), scope: __module.layer1/__module.layer1.2/__module.layer1.2.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %213 : bool = prim::Constant[value=1](), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %214 : bool = prim::Constant[value=0](), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %215 : int = prim::Constant[value=0](), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %216 : int = prim::Constant[value=1](), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %217 : NoneType = prim::Constant(), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv1
  %218 : float = prim::Constant[value=1.0000000000000001e-05](), scope: __module.layer2/__module.layer2.0/__module.layer2.0.bn1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %219 : float = prim::Constant[value=0.10000000000000001](), scope: __module.layer2/__module.layer2.0/__module.layer2.0.bn1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %220 : int = prim::Constant[value=2](), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %_3.1 : __torch__.torchvision.models.resnet.___torch_mangle_60.Bottleneck = prim::GetAttr[name="3"](%layer2)
  %_2.3 : __torch__.torchvision.models.resnet.___torch_mangle_52.Bottleneck = prim::GetAttr[name="2"](%layer2)
  %_1.7 : __torch__.torchvision.models.resnet.___torch_mangle_44.Bottleneck = prim::GetAttr[name="1"](%layer2)
  %_0.7 : __torch__.torchvision.models.resnet.___torch_mangle_36.Bottleneck = prim::GetAttr[name="0"](%layer2)
  %downsample.3 : __torch__.torch.nn.modules.container.___torch_mangle_35.Sequential = prim::GetAttr[name="downsample"](%_0.7)
  %bn3.7 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_31.BatchNorm2d = prim::GetAttr[name="bn3"](%_0.7)
  %conv3.7 : __torch__.torch.nn.modules.conv.___torch_mangle_30.Conv2d = prim::GetAttr[name="conv3"](%_0.7)
  %bn2.7 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_29.BatchNorm2d = prim::GetAttr[name="bn2"](%_0.7)
  %conv2.7 : __torch__.torch.nn.modules.conv.___torch_mangle_28.Conv2d = prim::GetAttr[name="conv2"](%_0.7)
  %relu.9 : __torch__.torch.nn.modules.activation.___torch_mangle_32.ReLU = prim::GetAttr[name="relu"](%_0.7)
  %bn1.9 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_27.BatchNorm2d = prim::GetAttr[name="bn1"](%_0.7)
  %conv1.9 : __torch__.torch.nn.modules.conv.___torch_mangle_26.Conv2d = prim::GetAttr[name="conv1"](%_0.7)
  %weight.461 : Tensor = prim::GetAttr[name="weight"](%conv1.9)
  %234 : int[] = prim::ListConstruct(%216, %216), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv1
  %235 : int[] = prim::ListConstruct(%215, %215), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv1
  %236 : int[] = prim::ListConstruct(%216, %216), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv1
  %237 : int[] = prim::ListConstruct(%215, %215), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv1
  %input.65 : Float(1, 128, 56, 56, strides=[401408, 3136, 56, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.63, %weight.461, %217, %234, %235, %236, %214, %237, %216, %214, %214, %213, %213), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.231 : Tensor = prim::GetAttr[name="running_var"](%bn1.9)
  %running_mean.231 : Tensor = prim::GetAttr[name="running_mean"](%bn1.9)
  %bias.231 : Tensor = prim::GetAttr[name="bias"](%bn1.9)
  %weight.463 : Tensor = prim::GetAttr[name="weight"](%bn1.9)
  %input.67 : Float(1, 128, 56, 56, strides=[401408, 3136, 56, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.65, %weight.463, %bias.231, %running_mean.231, %running_var.231, %214, %219, %218, %213), scope: __module.layer2/__module.layer2.0/__module.layer2.0.bn1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.69 : Float(1, 128, 56, 56, strides=[401408, 3136, 56, 1], requires_grad=0, device=cpu) = aten::relu_(%input.67), scope: __module.layer2/__module.layer2.0/__module.layer2.0.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %weight.465 : Tensor = prim::GetAttr[name="weight"](%conv2.7)
  %246 : int[] = prim::ListConstruct(%220, %220), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv2
  %247 : int[] = prim::ListConstruct(%216, %216), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv2
  %248 : int[] = prim::ListConstruct(%216, %216), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv2
  %249 : int[] = prim::ListConstruct(%215, %215), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv2
  %input.71 : Float(1, 128, 28, 28, strides=[100352, 784, 28, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.69, %weight.465, %217, %246, %247, %248, %214, %249, %216, %214, %214, %213, %213), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.233 : Tensor = prim::GetAttr[name="running_var"](%bn2.7)
  %running_mean.233 : Tensor = prim::GetAttr[name="running_mean"](%bn2.7)
  %bias.233 : Tensor = prim::GetAttr[name="bias"](%bn2.7)
  %weight.467 : Tensor = prim::GetAttr[name="weight"](%bn2.7)
  %input.73 : Float(1, 128, 28, 28, strides=[100352, 784, 28, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.71, %weight.467, %bias.233, %running_mean.233, %running_var.233, %214, %219, %218, %213), scope: __module.layer2/__module.layer2.0/__module.layer2.0.bn2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.75 : Float(1, 128, 28, 28, strides=[100352, 784, 28, 1], requires_grad=0, device=cpu) = aten::relu_(%input.73), scope: __module.layer2/__module.layer2.0/__module.layer2.0.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %weight.469 : Tensor = prim::GetAttr[name="weight"](%conv3.7)
  %258 : int[] = prim::ListConstruct(%216, %216), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv3
  %259 : int[] = prim::ListConstruct(%215, %215), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv3
  %260 : int[] = prim::ListConstruct(%216, %216), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv3
  %261 : int[] = prim::ListConstruct(%215, %215), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv3
  %input.77 : Float(1, 512, 28, 28, strides=[401408, 784, 28, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.75, %weight.469, %217, %258, %259, %260, %214, %261, %216, %214, %214, %213, %213), scope: __module.layer2/__module.layer2.0/__module.layer2.0.conv3 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.235 : Tensor = prim::GetAttr[name="running_var"](%bn3.7)
  %running_mean.235 : Tensor = prim::GetAttr[name="running_mean"](%bn3.7)
  %bias.235 : Tensor = prim::GetAttr[name="bias"](%bn3.7)
  %weight.471 : Tensor = prim::GetAttr[name="weight"](%bn3.7)
  %out.7 : Float(1, 512, 28, 28, strides=[401408, 784, 28, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.77, %weight.471, %bias.235, %running_mean.235, %running_var.235, %214, %219, %218, %213), scope: __module.layer2/__module.layer2.0/__module.layer2.0.bn3 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %_1.5 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_34.BatchNorm2d = prim::GetAttr[name="1"](%downsample.3)
  %_0.5 : __torch__.torch.nn.modules.conv.___torch_mangle_33.Conv2d = prim::GetAttr[name="0"](%downsample.3)
  %weight.473 : Tensor = prim::GetAttr[name="weight"](%_0.5)
  %271 : int[] = prim::ListConstruct(%220, %220), scope: __module.layer2/__module.layer2.0/__module.layer2.0.downsample/__module.layer2.0.downsample.0
  %272 : int[] = prim::ListConstruct(%215, %215), scope: __module.layer2/__module.layer2.0/__module.layer2.0.downsample/__module.layer2.0.downsample.0
  %273 : int[] = prim::ListConstruct(%216, %216), scope: __module.layer2/__module.layer2.0/__module.layer2.0.downsample/__module.layer2.0.downsample.0
  %274 : int[] = prim::ListConstruct(%215, %215), scope: __module.layer2/__module.layer2.0/__module.layer2.0.downsample/__module.layer2.0.downsample.0
  %input.79 : Float(1, 512, 28, 28, strides=[401408, 784, 28, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.63, %weight.473, %217, %271, %272, %273, %214, %274, %216, %214, %214, %213, %213), scope: __module.layer2/__module.layer2.0/__module.layer2.0.downsample/__module.layer2.0.downsample.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.237 : Tensor = prim::GetAttr[name="running_var"](%_1.5)
  %running_mean.237 : Tensor = prim::GetAttr[name="running_mean"](%_1.5)
  %bias.237 : Tensor = prim::GetAttr[name="bias"](%_1.5)
  %weight.475 : Tensor = prim::GetAttr[name="weight"](%_1.5)
  %identity.3 : Float(1, 512, 28, 28, strides=[401408, 784, 28, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.79, %weight.475, %bias.237, %running_mean.237, %running_var.237, %214, %219, %218, %213), scope: __module.layer2/__module.layer2.0/__module.layer2.0.downsample/__module.layer2.0.downsample.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.81 : Float(1, 512, 28, 28, strides=[401408, 784, 28, 1], requires_grad=0, device=cpu) = aten::add_(%out.7, %identity.3, %216), scope: __module.layer2/__module.layer2.0 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torchvision/models/resnet.py:160:0
  %input.83 : Float(1, 512, 28, 28, strides=[401408, 784, 28, 1], requires_grad=0, device=cpu) = aten::relu_(%input.81), scope: __module.layer2/__module.layer2.0/__module.layer2.0.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %bn3.9 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_42.BatchNorm2d = prim::GetAttr[name="bn3"](%_1.7)
  %conv3.9 : __torch__.torch.nn.modules.conv.___torch_mangle_41.Conv2d = prim::GetAttr[name="conv3"](%_1.7)
  %bn2.9 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_40.BatchNorm2d = prim::GetAttr[name="bn2"](%_1.7)
  %conv2.9 : __torch__.torch.nn.modules.conv.___torch_mangle_39.Conv2d = prim::GetAttr[name="conv2"](%_1.7)
  %relu.11 : __torch__.torch.nn.modules.activation.___torch_mangle_43.ReLU = prim::GetAttr[name="relu"](%_1.7)
  %bn1.11 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_38.BatchNorm2d = prim::GetAttr[name="bn1"](%_1.7)
  %conv1.11 : __torch__.torch.nn.modules.conv.___torch_mangle_37.Conv2d = prim::GetAttr[name="conv1"](%_1.7)
  %weight.477 : Tensor = prim::GetAttr[name="weight"](%conv1.11)
  %291 : int[] = prim::ListConstruct(%216, %216), scope: __module.layer2/__module.layer2.1/__module.layer2.1.conv1
  %292 : int[] = prim::ListConstruct(%215, %215), scope: __module.layer2/__module.layer2.1/__module.layer2.1.conv1
  %293 : int[] = prim::ListConstruct(%216, %216), scope: __module.layer2/__module.layer2.1/__module.layer2.1.conv1
  %294 : int[] = prim::ListConstruct(%215, %215), scope: __module.layer2/__module.layer2.1/__module.layer2.1.conv1
  %input.85 : Float(1, 128, 28, 28, strides=[100352, 784, 28, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.83, %weight.477, %217, %291, %292, %293, %214, %294, %216, %214, %214, %213, %213), scope: __module.layer2/__module.layer2.1/__module.layer2.1.conv1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.239 : Tensor = prim::GetAttr[name="running_var"](%bn1.11)
  %running_mean.239 : Tensor = prim::GetAttr[name="running_mean"](%bn1.11)
  %bias.239 : Tensor = prim::GetAttr[name="bias"](%bn1.11)
  %weight.479 : Tensor = prim::GetAttr[name="weight"](%bn1.11)
  %input.87 : Float(1, 128, 28, 28, strides=[100352, 784, 28, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.85, %weight.479, %bias.239, %running_mean.239, %running_var.239, %214, %219, %218, %213), scope: __module.layer2/__module.layer2.1/__module.layer2.1.bn1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.89 : Float(1, 128, 28, 28, strides=[100352, 784, 28, 1], requires_grad=0, device=cpu) = aten::relu_(%input.87), scope: __module.layer2/__module.layer2.1/__module.layer2.1.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %weight.481 : Tensor = prim::GetAttr[name="weight"](%conv2.9)
  %303 : int[] = prim::ListConstruct(%216, %216), scope: __module.layer2/__module.layer2.1/__module.layer2.1.conv2
  %304 : int[] = prim::ListConstruct(%216, %216), scope: __module.layer2/__module.layer2.1/__module.layer2.1.conv2
  %305 : int[] = prim::ListConstruct(%216, %216), scope: __module.layer2/__module.layer2.1/__module.layer2.1.conv2
  %306 : int[] = prim::ListConstruct(%215, %215), scope: __module.layer2/__module.layer2.1/__module.layer2.1.conv2
  %input.91 : Float(1, 128, 28, 28, strides=[100352, 784, 28, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.89, %weight.481, %217, %303, %304, %305, %214, %306, %216, %214, %214, %213, %213), scope: __module.layer2/__module.layer2.1/__module.layer2.1.conv2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.241 : Tensor = prim::GetAttr[name="running_var"](%bn2.9)
  %running_mean.241 : Tensor = prim::GetAttr[name="running_mean"](%bn2.9)
  %bias.241 : Tensor = prim::GetAttr[name="bias"](%bn2.9)
  %weight.483 : Tensor = prim::GetAttr[name="weight"](%bn2.9)
  %input.93 : Float(1, 128, 28, 28, strides=[100352, 784, 28, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.91, %weight.483, %bias.241, %running_mean.241, %running_var.241, %214, %219, %218, %213), scope: __module.layer2/__module.layer2.1/__module.layer2.1.bn2 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.95 : Float(1, 128, 28, 28, strides=[100352, 784, 28, 1], requires_grad=0, device=cpu) = aten::relu_(%input.93), scope: __module.layer2/__module.layer2.1/__module.layer2.1.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %weight.485 : Tensor = prim::GetAttr[name="weight"](%conv3.9)
  %315 : int[] = prim::ListConstruct(%216, %216), scope: __module.layer2/__module.layer2.1/__module.layer2.1.conv3
  %316 : int[] = prim::ListConstruct(%215, %215), scope: __module.layer2/__module.layer2.1/__module.layer2.1.conv3
  %317 : int[] = prim::ListConstruct(%216, %216), scope: __module.layer2/__module.layer2.1/__module.layer2.1.conv3
  %318 : int[] = prim::ListConstruct(%215, %215), scope: __module.layer2/__module.layer2.1/__module.layer2.1.conv3
  %input.97 : Float(1, 512, 28, 28, strides=[401408, 784, 28, 1], requires_grad=0, device=cpu) = aten::_convolution(%input.95, %weight.485, %217, %315, %316, %317, %214, %318, %216, %214, %214, %213, %213), scope: __module.layer2/__module.layer2.1/__module.layer2.1.conv3 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/modules/conv.py:548:0
  %running_var.243 : Tensor = prim::GetAttr[name="running_var"](%bn3.9)
  %running_mean.243 : Tensor = prim::GetAttr[name="running_mean"](%bn3.9)
  %bias.243 : Tensor = prim::GetAttr[name="bias"](%bn3.9)
  %weight.487 : Tensor = prim::GetAttr[name="weight"](%bn3.9)
  %out.9 : Float(1, 512, 28, 28, strides=[401408, 784, 28, 1], requires_grad=0, device=cpu) = aten::batch_norm(%input.97, %weight.487, %bias.243, %running_mean.243, %running_var.243, %214, %219, %218, %213), scope: __module.layer2/__module.layer2.1/__module.layer2.1.bn3 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:2846:0
  %input.99 : Float(1, 512, 28, 28, strides=[401408, 784, 28, 1], requires_grad=0, device=cpu) = aten::add_(%out.9, %input.83, %216), scope: __module.layer2/__module.layer2.1 # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torchvision/models/resnet.py:160:0
  %input.101 : Float(1, 512, 28, 28, strides=[401408, 784, 28, 1], requires_grad=0, device=cpu) = aten::relu_(%input.99), scope: __module.layer2/__module.layer2.1/__module.layer2.1.relu # /home/gorilla/Documents/Pytorch_static_analyzer/1_ExportingIR/.exportIRvenv/lib/python3.12/site-packages/torch/nn/functional.py:1719:0
  %bn3.11 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_50.BatchNorm2d = prim::GetAttr[name="bn3"](%_2.3)
  %conv3.11 : __torch__.torch.nn.modules.conv.___torch_mangle_49.Conv2d = prim::GetAttr[name="conv3"](%_2.3)
  %bn2.11 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_48.BatchNorm2d = prim::GetAttr[name="bn2"](%_2.3)
  %conv2.11 : __torch__.torch.nn.modules.conv.___torch_mangle_47.Conv2d = prim::GetAttr[name="conv2"](%_2.3)
  %relu.13 : __torch__.torch.nn.modules.activation.___torch_mangle_51.ReLU = prim::GetAttr[name="relu"](%_2.3)
  %bn1.13 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_46.BatchNorm2d = prim::GetAttr[name="bn1"](%_2.3)
  %conv1.13 : __torch__.torch.nn.modules.conv.___torch_mangle_45.Conv2d = prim::GetAttr[name="conv1"](%_2.3)
  %weight.489 : Tensor = prim::GetAttr[name="weight"](%conv1.13)
